<?php

declare(strict_types=1);

return [
    // Labels
    'user'  => 'مستخدم',
    'users' => 'مستخدمون',

    // Actions
    'edit' => 'تعديل',

    // Attributes
    'id'                      => 'المعرف',
    'name'                    => 'الاسم',
    'firstname'               => 'الاسم الأول',
    'surname'                 => 'الاسم الأخير',
    'email'                   => 'البريد الإلكتروني',
    'password'                => 'كلمة المرور',
    'current_password'        => 'كلمة المرور الحالية',
    'new_password'            => 'كلمة المرور الجديدة',
    'confirm_password'        => 'تأكيد كلمة المرور',
    'confirm_new_password'    => 'تأكيد كلمة المرور الجديدة',
    'language'                => 'اللغة',
    'timezone'                => 'المنطقة الزمنية',
    'developer'               => 'مطور',
    'team'                    => 'فريق',
    'current_team'            => 'الفريق الحالي',
    'email_verified'          => 'تم التحقق من البريد الإلكتروني',
    'email_verified_at'       => 'تم التحقق من البريد الإلكتروني في',
    'two_factor_confirmed_at' => 'تم تأكيد المصادقة الثنائية في',
    'seen_at'                 => 'آخر ظهور في',

    // Photo
    'photo'        => 'الصورة الشخصية',
    'select_photo' => 'اختر صورة شخصية جديدة',
    'remove_photo' => 'إزالة الصورة الشخصية',

    // Deletion confirm attributes
    'delete'                => 'حذف المستخدم',
    'delete_confirm'        => 'هل أنت متأكد من حذف هذا المستخدم؟',
    'delete_confirm_button' => 'نعم، أنا متأكد',

    // Messages
    'profile'                    => 'الملف الشخصي',
    'profile_information'        => 'معلومات الملف الشخصي',
    'profile_information_update' => 'تحديث معلومات ملفك الشخصي وعنوان بريدك الإلكتروني.',

    'update_password'        => 'تحديث كلمة المرور',
    'update_password_secure' => 'تأكد من أن حسابك يستخدم كلمة مرور طويلة وعشوائية للبقاء آمناً.',
    'password_no_match'      => 'كلمة المرور المقدمة لا تطابق كلمة المرور الحالية.',

    '2fa'              => 'المصادقة الثنائية',
    '2fa_add'          => 'أضف أماناً إضافياً لحسابك باستخدام المصادقة الثنائية.',
    '2fa_finish'       => 'إنهاء تفعيل المصادقة الثنائية',
    '2fa_enabled'      => 'لقد قمت بتفعيل المصادقة الثنائية.',
    '2fa_not_enabled'  => 'لم تقم بتفعيل المصادقة الثنائية بعد.',
    '2fa_message'      => 'عند تفعيل المصادقة الثنائية، ستُطلب منك رمز آمن وعشوائي أثناء المصادقة. يمكنك استرداد هذا الرمز من تطبيق Google Authenticator على هاتفك.',
    '2fa_to_finish'    => 'لإنهاء تفعيل المصادقة الثنائية، امسح رمز QR التالي باستخدام تطبيق المصادقة على هاتفك أو أدخل مفتاح الإعداد وقدم رمز OTP المُولد.',
    '2fa_enabled_scan' => 'تم تفعيل المصادقة الثنائية الآن. امسح رمز QR التالي باستخدام تطبيق المصادقة على هاتفك أو أدخل مفتاح الإعداد.',
    '2fa_setup_key'    => 'مفتاح الإعداد',
    '2fa_code'         => 'الرمز',
    '2fa_store_codes'  => 'احفظ رموز الاسترداد هذه في مدير كلمات مرور آمن. يمكن استخدامها لاسترداد الوصول إلى حسابك إذا فقدت جهاز المصادقة الثنائية.',
    '2fa_enable'       => 'تفعيل',
    '2fa_regenerate'   => 'إعادة توليد رموز الاسترداد',
    '2fa_confirm'      => 'تأكيد',
    '2fa_show'         => 'إظهار رموز الاسترداد',
    'cancel'           => 'إلغاء',
    '2fa_disable'      => 'إلغاء التفعيل',

    'browser_sessions'         => 'جلسات المتصفح',
    'browser_sessions_manage'  => 'إدارة وتسجيل الخروج من جلساتك النشطة على المتصفحات والأجهزة الأخرى.',
    'browser_sessions_message' => 'إذا لزم الأمر، يمكنك تسجيل الخروج من جميع جلسات المتصفح الأخرى على جميع أجهزتك. بعض جلساتك الأخيرة مدرجة أدناه؛ ومع ذلك، قد لا تكون هذه القائمة شاملة. إذا شعرت أن حسابك قد تم اختراقه، يجب عليك أيضاً تحديث كلمة المرور.',
    'Unknown'                  => 'غير معروف',
    'this_device'              => 'هذا الجهاز',
    'last_active'              => 'آخر نشاط',
    'log_out'                  => 'تسجيل الخروج من جلسات المتصفح الأخرى',
    'enter_password'           => 'يرجى إدخال كلمة المرور لتأكيد أنك تريد تسجيل الخروج من جلسات المتصفح الأخرى على جميع أجهزتك.',
    'done'                     => 'تم.',

    'delete_account'             => 'حذف الحساب',
    'delete_account_permanently' => 'حذف حسابك نهائياً.',
    'once_deleted'               => 'بمجرد حذف حسابك، سيتم حذف جميع موارده وبياناته نهائياً. قبل حذف حسابك، يرجى تحميل أي بيانات أو معلومات تريد الاحتفاظ بها.',
    'sure'                       => 'هل أنت متأكد من أنك تريد حذف حسابك؟ بمجرد حذف حسابك، سيتم حذف جميع موارده وبياناته نهائياً. يرجى إدخال كلمة المرور لتأكيد أنك تريد حذف حسابك نهائياً.',
    'can_not_delete'             => 'لا يمكن حذف حسابك لأنه يحتوي على بيانات صالحة.',

    'email_unverified'               => 'عنوان بريدك الإلكتروني لم يتم التحقق منه بعد.',
    'click_resend_verification_mail' => 'إعادة إرسال بريد التحقق.',
    'verififacion_mail_send'         => 'تم إرسال رابط تحقق جديد إلى عنوان بريدك الإلكتروني.',

];
